--------------------------------------------------------
--  파일이 생성됨 - 월요일-12월-23-2019   
--------------------------------------------------------
--------------------------------------------------------
--  DDL for View VIEW_SC_ST
--------------------------------------------------------

  CREATE OR REPLACE FORCE VIEW "VIEW_SC_ST" ("학번", "이름", "학과코드", "국어", "영어", "수학") AS 
  (
    SELECT SC.s_num AS 학번, ST.st_name AS 이름,
            ST.st_dept AS 학과코드, SC.s_kor AS 국어, SC.s_eng AS 영어, SC.s_math AS 수학
    FROM tbl_score SC
        LEFT JOIN tbl_student ST
            ON SC.s_num = ST.st_num
)
;
--------------------------------------------------------
--  DDL for View VIEW_SCORE
--------------------------------------------------------

  CREATE OR REPLACE FORCE VIEW "VIEW_SCORE" ("S_NUM", "ST_NAME", "S_DEPT", "D_NAME", "D_PRO", "S_KOR", "S_ENG", "S_MATH", "총점", "평균") AS 
  (
SELECT SC.s_num, ST.st_name, SC.s_dept, DP.d_name, DP.d_pro, SC.s_kor, SC.s_eng, SC.s_math,
        SC.s_kor + SC.s_eng + SC.s_math AS 총점,
        ROUND((SC.s_kor + SC.s_eng + SC.s_math) / 3, 0) AS 평균
FROM tbl_score2 SC
    LEFT JOIN tbl_student ST
        ON SC.s_num = ST.st_num
    LEFT JOIN tbl_dept DP
        ON SC.s_dept = DP.d_num
)
;
--------------------------------------------------------
--  DDL for View VIEW_ST_DEPT
--------------------------------------------------------

  CREATE OR REPLACE FORCE VIEW "VIEW_ST_DEPT" ("학번", "이름", "학과코드", "학과이름", "담임교수") AS 
  (
    SELECT ST.st_num 학번, 
            ST.st_name 이름,
            ST.st_dept 학과코드,
            DP.d_name 학과이름,
            DP.d_pro 담임교수
    FROM tbl_student ST
        LEFT JOIN tbl_dept DP
            ON ST.st_dept = DP.d_num
)
;
--------------------------------------------------------
--  DDL for View VIEW_성적일람표
--------------------------------------------------------

  CREATE OR REPLACE FORCE VIEW "VIEW_성적일람표" ("학번", "학생이름", "학과코드", "학과이름", "담임교수", "국어", "영어", "수학", "총점", "평균", "석차") AS 
  (
    SELECT SC.s_num AS 학번, 
            ST.st_name AS 학생이름 , 
            ST.st_dept AS 학과코드, 
            DP.d_name AS 학과이름, 
            DP.d_pro AS 담임교수,
            SC.s_kor AS 국어,
            SC.s_eng AS 영어,
            SC.s_math AS 수학,
            SC.s_kor + SC.s_eng + SC.s_math AS 총점,
            ROUND((SC.s_kor + SC.s_eng + SC.s_math) / 3,0) AS 평균,
            RANK() OVER (ORDER BY (SC.s_kor + SC.s_eng + SC.s_math) DESC) AS 석차
    FROM tbl_score SC
        LEFT JOIN tbl_student ST
            ON SC.s_num = ST.st_num 
        LEFT JOIN tbl_dept DP
            ON ST.st_dept = DP.d_num
)
;
REM INSERTING into VIEW_SC_ST
SET DEFINE OFF;
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('001','갈한수','004',70,91,77);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('002','강이찬','004',88,86,58);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('003','개원훈','003',53,70,52);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('004','경시현','004',87,82,82);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('005','공동영','003',54,61,66);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('006','기대연','004',54,76,82);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('007','기원호','002',77,96,100);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('008','기은성','004',77,59,54);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('009','나한율','001',66,57,59);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('010','남동예','001',61,71,86);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('011','낭시우','002',90,66,72);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('012','내세원','003',77,92,70);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('013','뇌성수','003',54,51,61);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('014','단수혁','004',99,95,70);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('015','담성민','003',73,54,81);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('016','담원준','003',55,52,66);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('017','담장호','003',88,81,63);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('018','독고예준','003',58,73,75);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('019','돈송혁','005',63,59,74);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('020','돈재현','004',84,75,95);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('021','두동환','002',76,74,88);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('022','두채훈','001',94,72,67);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('023','명윤일','002',65,97,88);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('024','모재원','003',50,54,94);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('025','문은진','004',50,60,55);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('026','박수혁','001',86,87,79);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('027','방윤후','001',70,55,74);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('028','방채호','004',74,91,100);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('029','배세준','003',62,82,82);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('030','배채호','004',69,90,61);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('031','변재호','004',51,54,58);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('032','복재민','003',77,79,100);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('033','복준완','001',82,97,87);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('034','비현호','003',80,71,69);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('035','빈성희','005',64,54,90);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('036','사성준','005',94,69,80);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('037','사원혁','002',88,53,86);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('038','사원호','001',62,71,97);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('039','삼윤후','002',64,53,61);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('040','삼찬후','005',75,50,97);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('041','석서훈','001',85,85,86);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('042','성성율','003',90,61,50);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('043','소대권','001',76,52,60);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('044','소윤수','002',100,57,70);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('045','순대영','001',56,90,73);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('046','신찬영','003',95,98,64);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('047','심장호','003',74,80,95);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('048','아동은','004',75,99,53);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('049','야유신','001',84,67,64);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('050','양동인','001',88,53,66);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('051','양은성','002',90,57,93);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('052','어민기','003',75,61,52);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('053','엄은진','002',75,78,52);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('054','여동은','005',54,59,54);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('055','여민국','005',78,69,59);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('056','연연재','003',64,80,98);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('057','옥원준','005',72,92,96);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('058','옥채훈','003',72,64,53);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('059','옹효성','004',51,61,86);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('060','운윤태','002',87,51,73);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('061','원성빈','002',65,55,73);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('062','유민국','001',81,67,60);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('063','유성율','002',58,99,92);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('064','유준호','004',66,71,80);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('065','은채혁','003',82,85,57);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('066','은현준','005',65,70,89);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('067','이윤진','004',82,88,87);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('068','전동원','005',56,81,86);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('069','점재민','003',66,53,74);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('070','제갈동연','002',81,94,97);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('071','제동희','001',76,74,84);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('072','제민기','001',67,70,93);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('073','제영후','005',98,60,59);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('074','제유상','004',52,78,96);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('075','지승현','001',76,85,59);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('076','진대원','005',82,79,72);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('077','진대윤','001',81,86,70);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('078','진동혜','005',60,67,97);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('079','진승우','003',69,72,60);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('080','진승일','003',62,77,83);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('081','진승환','004',87,56,98);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('082','초시민','001',97,88,81);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('083','초원혁','005',93,99,93);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('084','초재현','001',95,80,87);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('085','최장현','004',56,87,94);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('086','춘대권','003',71,83,83);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('087','춘인규','001',77,93,68);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('088','춘찬영','001',93,83,82);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('089','판한수','001',81,65,73);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('090','평윤섭','003',87,84,56);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('091','풍동해','002',56,82,52);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('092','피태영','002',79,74,54);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('093','필영후','005',90,86,61);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('094','하재찬','004',88,75,94);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('095','함민서','005',55,64,54);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('096','해송혁','003',82,99,67);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('097','허시후','003',50,65,83);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('098','황원혁','005',81,94,77);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('099','흥동현','005',75,95,83);
Insert into VIEW_SC_ST ("학번","이름","학과코드","국어","영어","수학") values ('100','흥은성','005',50,78,86);
REM INSERTING into VIEW_SCORE
SET DEFINE OFF;
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('001','갈한수','001','컴퓨터공학','홍길동',70,100,66,236,79);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('002','강이찬','003','경영학','임꺽정',94,96,98,288,96);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('003','개원훈','002','영어영문','성춘향',89,79,87,255,85);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('004','경시현','001','컴퓨터공학','홍길동',61,82,66,209,70);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('005','공동영','003','경영학','임꺽정',63,64,98,225,75);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('006','기대연','004','정치경제','장보고',89,50,61,200,67);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('007','기원호','005','군사학','이순신',69,84,92,245,82);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('008','기은성','002','영어영문','성춘향',59,71,64,194,65);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('009','나한율','003','경영학','임꺽정',67,90,83,240,80);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('010','남동예','004','정치경제','장보고',85,96,93,274,91);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('011','낭시우','005','군사학','이순신',53,53,82,188,63);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('012','내세원','001','컴퓨터공학','홍길동',99,51,53,203,68);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('013','뇌성수','002','영어영문','성춘향',99,82,68,249,83);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('014','단수혁','003','경영학','임꺽정',68,62,72,202,67);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('015','담성민','004','정치경제','장보고',87,93,57,237,79);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('016','담원준','005','군사학','이순신',86,65,88,239,80);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('017','담장호','002','영어영문','성춘향',50,65,97,212,71);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('018','독고예준','001','컴퓨터공학','홍길동',51,75,100,226,75);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('019','돈송혁','003','경영학','임꺽정',88,62,60,210,70);
Insert into VIEW_SCORE (S_NUM,ST_NAME,S_DEPT,D_NAME,D_PRO,S_KOR,S_ENG,S_MATH,"총점","평균") values ('020','돈재현','004','정치경제','장보고',69,93,97,259,86);
REM INSERTING into VIEW_ST_DEPT
SET DEFINE OFF;
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('089','판한수','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('088','춘찬영','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('087','춘인규','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('084','초재현','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('082','초시민','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('077','진대윤','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('075','지승현','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('072','제민기','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('071','제동희','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('062','유민국','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('050','양동인','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('049','야유신','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('045','순대영','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('043','소대권','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('041','석서훈','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('038','사원호','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('033','복준완','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('027','방윤후','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('026','박수혁','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('022','두채훈','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('010','남동예','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('009','나한율','001','컴퓨터공학','홍길동');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('092','피태영','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('091','풍동해','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('070','제갈동연','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('063','유성율','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('061','원성빈','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('060','운윤태','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('053','엄은진','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('051','양은성','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('044','소윤수','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('039','삼윤후','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('037','사원혁','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('023','명윤일','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('021','두동환','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('011','낭시우','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('007','기원호','002','영어영문','성춘향');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('097','허시후','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('096','해송혁','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('090','평윤섭','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('086','춘대권','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('080','진승일','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('079','진승우','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('069','점재민','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('065','은채혁','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('058','옥채훈','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('056','연연재','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('052','어민기','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('047','심장호','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('046','신찬영','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('042','성성율','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('034','비현호','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('032','복재민','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('029','배세준','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('024','모재원','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('018','독고예준','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('017','담장호','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('016','담원준','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('015','담성민','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('013','뇌성수','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('012','내세원','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('005','공동영','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('003','개원훈','003','경영학','임꺽정');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('094','하재찬','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('085','최장현','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('081','진승환','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('074','제유상','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('067','이윤진','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('064','유준호','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('059','옹효성','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('048','아동은','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('031','변재호','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('030','배채호','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('028','방채호','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('025','문은진','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('020','돈재현','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('014','단수혁','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('008','기은성','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('006','기대연','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('004','경시현','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('002','강이찬','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('001','갈한수','004','정치경제','장보고');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('100','흥은성','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('099','흥동현','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('098','황원혁','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('095','함민서','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('093','필영후','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('083','초원혁','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('078','진동혜','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('076','진대원','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('073','제영후','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('068','전동원','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('066','은현준','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('057','옥원준','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('055','여민국','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('054','여동은','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('040','삼찬후','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('036','사성준','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('035','빈성희','005','군사학','이순신');
Insert into VIEW_ST_DEPT ("학번","이름","학과코드","학과이름","담임교수") values ('019','돈송혁','005','군사학','이순신');
REM INSERTING into "VIEW_성적일람표"
SET DEFINE OFF;
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('083','초원혁','005','군사학','이순신',93,99,93,285,95,1);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('007','기원호','002','영어영문','성춘향',77,96,100,273,91,2);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('070','제갈동연','002','영어영문','성춘향',81,94,97,272,91,3);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('033','복준완','001','컴퓨터공학','홍길동',82,97,87,266,89,4);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('082','초시민','001','컴퓨터공학','홍길동',97,88,81,266,89,4);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('028','방채호','004','정치경제','장보고',74,91,100,265,88,6);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('014','단수혁','004','정치경제','장보고',99,95,70,264,88,7);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('084','초재현','001','컴퓨터공학','홍길동',95,80,87,262,87,8);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('057','옥원준','005','군사학','이순신',72,92,96,260,87,9);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('088','춘찬영','001','컴퓨터공학','홍길동',93,83,82,258,86,10);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('094','하재찬','004','정치경제','장보고',88,75,94,257,86,11);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('046','신찬영','003','경영학','임꺽정',95,98,64,257,86,11);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('067','이윤진','004','정치경제','장보고',82,88,87,257,86,11);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('032','복재민','003','경영학','임꺽정',77,79,100,256,85,14);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('041','석서훈','001','컴퓨터공학','홍길동',85,85,86,256,85,14);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('020','돈재현','004','정치경제','장보고',84,75,95,254,85,16);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('099','흥동현','005','군사학','이순신',75,95,83,253,84,17);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('026','박수혁','001','컴퓨터공학','홍길동',86,87,79,252,84,18);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('098','황원혁','005','군사학','이순신',81,94,77,252,84,18);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('004','경시현','004','정치경제','장보고',87,82,82,251,84,20);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('023','명윤일','002','영어영문','성춘향',65,97,88,250,83,21);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('047','심장호','003','경영학','임꺽정',74,80,95,249,83,22);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('063','유성율','002','영어영문','성춘향',58,99,92,249,83,22);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('096','해송혁','003','경영학','임꺽정',82,99,67,248,83,24);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('036','사성준','005','군사학','이순신',94,69,80,243,81,25);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('056','연연재','003','경영학','임꺽정',64,80,98,242,81,26);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('081','진승환','004','정치경제','장보고',87,56,98,241,80,27);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('051','양은성','002','영어영문','성춘향',90,57,93,240,80,28);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('012','내세원','003','경영학','임꺽정',77,92,70,239,80,29);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('001','갈한수','004','정치경제','장보고',70,91,77,238,79,30);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('021','두동환','002','영어영문','성춘향',76,74,88,238,79,30);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('087','춘인규','001','컴퓨터공학','홍길동',77,93,68,238,79,30);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('085','최장현','004','정치경제','장보고',56,87,94,237,79,33);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('086','춘대권','003','경영학','임꺽정',71,83,83,237,79,33);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('093','필영후','005','군사학','이순신',90,86,61,237,79,33);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('077','진대윤','001','컴퓨터공학','홍길동',81,86,70,237,79,33);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('071','제동희','001','컴퓨터공학','홍길동',76,74,84,234,78,37);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('076','진대원','005','군사학','이순신',82,79,72,233,78,38);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('022','두채훈','001','컴퓨터공학','홍길동',94,72,67,233,78,38);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('002','강이찬','004','정치경제','장보고',88,86,58,232,77,40);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('017','담장호','003','경영학','임꺽정',88,81,63,232,77,40);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('072','제민기','001','컴퓨터공학','홍길동',67,70,93,230,77,42);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('038','사원호','001','컴퓨터공학','홍길동',62,71,97,230,77,42);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('011','낭시우','002','영어영문','성춘향',90,66,72,228,76,44);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('044','소윤수','002','영어영문','성춘향',100,57,70,227,76,45);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('037','사원혁','002','영어영문','성춘향',88,53,86,227,76,45);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('048','아동은','004','정치경제','장보고',75,99,53,227,76,45);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('090','평윤섭','003','경영학','임꺽정',87,84,56,227,76,45);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('029','배세준','003','경영학','임꺽정',62,82,82,226,75,49);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('074','제유상','004','정치경제','장보고',52,78,96,226,75,49);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('065','은채혁','003','경영학','임꺽정',82,85,57,224,75,51);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('078','진동혜','005','군사학','이순신',60,67,97,224,75,51);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('066','은현준','005','군사학','이순신',65,70,89,224,75,51);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('068','전동원','005','군사학','이순신',56,81,86,223,74,54);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('040','삼찬후','005','군사학','이순신',75,50,97,222,74,55);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('080','진승일','003','경영학','임꺽정',62,77,83,222,74,55);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('030','배채호','004','정치경제','장보고',69,90,61,220,73,57);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('075','지승현','001','컴퓨터공학','홍길동',76,85,59,220,73,57);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('034','비현호','003','경영학','임꺽정',80,71,69,220,73,57);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('089','판한수','001','컴퓨터공학','홍길동',81,65,73,219,73,60);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('045','순대영','001','컴퓨터공학','홍길동',56,90,73,219,73,60);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('010','남동예','001','컴퓨터공학','홍길동',61,71,86,218,73,62);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('064','유준호','004','정치경제','장보고',66,71,80,217,72,63);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('073','제영후','005','군사학','이순신',98,60,59,217,72,63);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('049','야유신','001','컴퓨터공학','홍길동',84,67,64,215,72,65);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('100','흥은성','005','군사학','이순신',50,78,86,214,71,66);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('006','기대연','004','정치경제','장보고',54,76,82,212,71,67);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('060','운윤태','002','영어영문','성춘향',87,51,73,211,70,68);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('015','담성민','003','경영학','임꺽정',73,54,81,208,69,69);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('035','빈성희','005','군사학','이순신',64,54,90,208,69,69);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('062','유민국','001','컴퓨터공학','홍길동',81,67,60,208,69,69);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('092','피태영','002','영어영문','성춘향',79,74,54,207,69,72);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('050','양동인','001','컴퓨터공학','홍길동',88,53,66,207,69,72);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('055','여민국','005','군사학','이순신',78,69,59,206,69,74);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('018','독고예준','003','경영학','임꺽정',58,73,75,206,69,74);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('053','엄은진','002','영어영문','성춘향',75,78,52,205,68,76);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('079','진승우','003','경영학','임꺽정',69,72,60,201,67,77);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('042','성성율','003','경영학','임꺽정',90,61,50,201,67,77);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('027','방윤후','001','컴퓨터공학','홍길동',70,55,74,199,66,79);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('059','옹효성','004','정치경제','장보고',51,61,86,198,66,80);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('024','모재원','003','경영학','임꺽정',50,54,94,198,66,80);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('097','허시후','003','경영학','임꺽정',50,65,83,198,66,80);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('019','돈송혁','005','군사학','이순신',63,59,74,196,65,83);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('061','원성빈','002','영어영문','성춘향',65,55,73,193,64,84);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('069','점재민','003','경영학','임꺽정',66,53,74,193,64,84);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('008','기은성','004','정치경제','장보고',77,59,54,190,63,86);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('091','풍동해','002','영어영문','성춘향',56,82,52,190,63,86);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('058','옥채훈','003','경영학','임꺽정',72,64,53,189,63,88);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('043','소대권','001','컴퓨터공학','홍길동',76,52,60,188,63,89);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('052','어민기','003','경영학','임꺽정',75,61,52,188,63,89);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('009','나한율','001','컴퓨터공학','홍길동',66,57,59,182,61,91);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('005','공동영','003','경영학','임꺽정',54,61,66,181,60,92);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('039','삼윤후','002','영어영문','성춘향',64,53,61,178,59,93);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('003','개원훈','003','경영학','임꺽정',53,70,52,175,58,94);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('016','담원준','003','경영학','임꺽정',55,52,66,173,58,95);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('095','함민서','005','군사학','이순신',55,64,54,173,58,95);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('054','여동은','005','군사학','이순신',54,59,54,167,56,97);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('013','뇌성수','003','경영학','임꺽정',54,51,61,166,55,98);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('025','문은진','004','정치경제','장보고',50,60,55,165,55,99);
Insert into "VIEW_성적일람표" ("학번","학생이름","학과코드","학과이름","담임교수","국어","영어","수학","총점","평균","석차") values ('031','변재호','004','정치경제','장보고',51,54,58,163,54,100);
